aaron-bond.better-comments
abusaidm.html-snippets
alefragnani.project-manager
bracketpaircolordlw.bracket-pair-color-dlw
bradgashler.htmltagwrap
christian-kohler.path-intellisense
dbaeumer.vscode-eslint
dracula-theme.theme-dracula
dskwrk.vscode-generate-getter-setter
dzhavat.bracket-pair-toggler
eamodio.gitlens
ecmel.vscode-html-css
esbenp.prettier-vscode
formulahendry.auto-close-tag
formulahendry.auto-rename-tag
github.copilot
github.copilot-chat
humao.rest-client
kisstkondoros.vscode-gutter-preview
ms-dotnettools.vscode-dotnet-modernize
ms-dotnettools.vscode-dotnet-runtime
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
naumovs.color-highlight
negokaz.live-server-preview
oderwat.indent-rainbow
pkief.material-icon-theme
pnp.polacode
redhat.java
ritwickdey.liveserver
rodrigovallades.es7-react-js-snippets
solnurkarim.html-to-css-autocompletion
steoates.autoimport
streetsidesoftware.code-spell-checker
streetsidesoftware.code-spell-checker-vietnamese
tonybaloney.vscode-pets
twxs.cmake
usernamehw.errorlens
vadimcn.vscode-lldb
visualstudioexptteam.intellicode-api-usage-examples
visualstudioexptteam.vscodeintellicode
vscjava.migrate-java-to-azure
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-java-upgrade
vscjava.vscode-maven
xabikos.javascriptsnippets
